=  TP 5/5 Packet Tracer : Configuration des paramètres initiaux du routeur
:navtitle: paramétrages initiaux du routeur

== Objectifs

[none]
* Partie 1 : vérifier la configuration par défaut du routeur
* Partie 2 : configurer et vérifier la configuration initiale du routeur
* Partie 3 : enregistrer le fichier de configuration en cours

== Le contexte

Au cours de cet exercice, vous allez effectuer des configurations de base sur les routeurs, Vous sécuriserez l'accès au port de console et CLI à l'aide de mots de passe chiffrés. et configurer les messages affichés lors de la connexion des utilisateurs au routeur. Ces bannières avertiront les intrus que l'accès est interdit. Enfin, vous allez vérifier et enregistrer votre configuration en cours.

== Partie 1 : vérifier la configuration par défaut du routeur

=== Étape 1 : Établissez une connexion console avec R1.

[frame=none,grid=none,cols="~,~"]
|===
|a.     |Choisissez le câble bleu *Console* parmi les connexions disponibles.
|b.     |Cliquez sur *PCA*, puis sélectionnez *RS 232*.
|c.     |Faites glisser le câble, cliquez sur *R1*, puis sélectionnez *Console*.
|d.     |Cliquez sur *PCA* > onglet *Desktop* > *Terminal*.
|e.     |Cliquez sur *OK*, puis appuyez sur *Entrée*. Vous êtes maintenant en mesure de configurer *R1*.
|===

image:tssr2023/modules-07/TP/01_5/01.png[]

=== Étape 2 : Accédez au mode privilégié, puis examinez la configuration actuelle.

Vous pouvez accéder à l'ensemble des commandes du routeur en mode d'exécution privilégié. Toutefois, comme un grand nombre de commandes du mode privilégié permettent de configurer des paramètres système, l'accès privilégié doit être protégé par mot de passe pour empêcher toute utilisation non autorisée.

[frame=none,grid=none,cols="~,~"]
|===
.3+|a.     |Accédez au mode d'exécution privilégié en entrant la commande *enable*.
a|
.Commande iOS
[source,bash]
----
Router> enable
Router#
----
|Notez que l'invite a changé dans la configuration pour représenter le mode d'exécution privilégié.
.7+|b.     |Saisissez la commande show running-config :
a|
.Commande iOS
[source,bash]
----
Router# show running-config
----
a|
.Retour iOS
----
Building configuration...

Current configuration : 1072 bytes
!
version 15.1
no service timestamps log datetime msec
no service timestamps debug datetime msec
no service password-encryption
!
hostname Router
[...]
ip cef
no ipv6 cef
----
a|
.Commande iOS
[source,bash]
----
Router#show  ip interface brief
----
a|
.Retour iOS
----
Interface              IP-Address      OK? Method Status                Protocol 
GigabitEthernet0/0     unassigned      YES unset  administratively down down 
GigabitEthernet0/1     unassigned      YES unset  administratively down down 
Serial0/0/0            unassigned      YES unset  administratively down down 
Serial0/0/1            unassigned      YES unset  administratively down down 
FastEthernet0/1/0      unassigned      YES unset  up                    down 
FastEthernet0/1/1      unassigned      YES unset  up                    down 
FastEthernet0/1/2      unassigned      YES unset  up                    down 
FastEthernet0/1/3      unassigned      YES unset  up                    down 
Vlan1                  unassigned      YES unset  administratively down down
----
a|
.Commande iOS
[source,bash]
----
Router#show line 
----
a|
.Retour iOS
----
   Tty Line Typ     Tx/Rx    A Roty AccO AccI   Uses   Noise  Overruns   Int
*    0    0 CTY              -    -    -    -      0       0     0/0       -
     1    1 AUX   9600/9600  -    -    -    -      0       0     0/0       -
   132  132 VTY              -    -    -    -      0       0     0/0       -
   133  133 VTY              -    -    -    -      0       0     0/0       -
   134  134 VTY              -    -    -    -      0       0     0/0       -
   135  135 VTY              -    -    -    -      0       0     0/0       -
   136  136 VTY              -    -    -    -      0       0     0/0       -
Line(s) not in async mode -or- with no hardware support:
3-131
----

.11+|c.     |Répondez aux questions suivantes :
|Quel est le nom d'hôte du routeur ?
a|
[TIP,caption=Réponse]
====
Son nom est : *Router*
====
|Combien d'interfaces Fast Ethernet le routeur possède-t-il ? 
a|
[TIP,caption=Réponse]
====
Il possèdes '*4*' interfaces _Fast Ethernet_.
====
|Combien d'interfaces Gigabit Ethernet le routeur possède-t-il ? 
a|
[TIP,caption=Réponse]
====
Il possèdes '*2*' interfaces _Gigabit Ethernet_.
====
|Combien d'interfaces série le routeur possède-t-il ?
a|
[TIP,caption=Réponse]
====
Il possèdes '*2*' interfaces _série_.
====
|Quelle est la plage de valeurs affichée pour les lignes vty ?
a|
[CAUTION,caption=Réponse Douteuse]
====
Je dirais que la plage vty est *0-15*.
====
.4+|d.    | Examinez le contenu actuel de la mémoire vive non volatile (NVRAM).
a|
.Commande iOS
[source,bash]
----
Router# show startup-config
startup-config is not present
----
|Pourquoi le routeur répond-il avec le message startup-config is not present ?
a|
[TIP,caption=Réponse]
====
Ce comportement est *Normal*, cas le routeur n'a pas été paramétré.

De plus aucune sauvegarde vers `*startup-config*` n'a été effectué.
====
|===

== Partie 2 : configurer et vérifier la configuration initiale du routeur

Pour configurer les paramètres d'un routeur, vous devrez peut-être passer d'un mode de configuration à l'autre. Notez que l'invite change lorsque vous utilisez le routeur.

=== Étape 1 :Configurez les paramètres initiaux du routeur R1.

[NOTE,caption=Remarque]
====
Si vous avez du mal à vous souvenir des commandes, référez-vous au contenu de cette rubrique. Les commandes sont les mêmes que celles que vous avez configurées sur le commutateur.
====

[frame=none,grid=none,cols="~,~"]
|===
.2+|a.    | Configurez R1 comme nom d'hôte.
a|
.Commande iOS
[source,bash]
----
Router>
Router>enable 
Router#configure terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Router(config)#hostname R1
R1(config)#
R1#
%SYS-5-CONFIG_I: Configured from console by console
R1#
----
.2+|b.    | Configurez letmein comme mot de passe console, puis activez la connexion.
a|
.Commande iOS
[source,bash]
----
R1#
R1#configure terminal 
R1(config)#line console 0
R1(config-line)#
R1(config-line)# password letmein
R1(config-line)# login
R1(config-line)# exit
R1(config)#
----
.2+|c.     |Configurez itsasecret comme mot de passe du mode d'exécution privilégié chiffré.
a|
.Commande iOS
[source,bash]
----
R1(config)#
R1(config)#enable secret itsasecret
----
.2+|d.     |Chiffrez tous les mots de passe en clair.
a|
.Commande iOS
[source,bash]
----
R1(config)#
R1(config)#service password-encryption 
R1(config)#end
#Vérification
R1#show running-config
[...]
line con 0
 password 7 082D495A041C0C19
 login
!
[...]

----
.2+|e.    | Configurez une bannière MOTD (message of the day, ou message du jour) pour avertir les utilisateurs en cas d'accès non autorisé. Un exemple de bannière peut afficher le message Unauthorized access is strictly prohibited (Tout accès non autorisé est strictement interdit).
a|
.Commande iOS
[source,bash]
----
R1#
R1#configure terminal 
R1(config)# banner motd "Unauthorized access is strictly prohibited (Tout acces non autorise est strictement interdit)"
----
|===

=== Étape 2 :Vérifiez les paramètres initiaux du routeur R1.

[frame=none,grid=none,cols="~,~"]
|===
.3+|a.     |Vérifiez les paramètres initiaux en affichant la configuration de R1. Quelle commande utilisez-vous ?
a|
[TIP,caption=Réponse]
====
J'utilise la commande `*show startup-config*`

Mais d'abord je dois sauvegarder les paramètres. -> `*copy running-config startup-config*`
====
a|
.Commande iOS
[source,bash]
----
#Sauvegarde des paramètre
R1#copy running-config startup-config
# Vérification
R1#show startup-config 
----

.Retour iOS
----
Using 1279 bytes
!
version 15.1
no service timestamps log datetime msec
no service timestamps debug datetime msec
service password-encryption
[...]
hostname R1
[...]
enable secret 5 $1$mERr$ILwq/b7kc.7X/ejA4Aosn0
[...]
ip cef
no ipv6 cef
[...]
license udi pid CISCO1941/K9 sn FTX152459PZ
[...]
spanning-tree mode pvst
[...]
interface GigabitEthernet0/0
 no ip address
 duplex auto
 speed auto
 shutdown
!
interface GigabitEthernet0/1
 no ip address
 duplex auto
 speed auto
 shutdown
!
interface Serial0/0/0
 no ip address
 clock rate 2000000
 shutdown
!
interface Serial0/0/1
 no ip address
 clock rate 2000000
 shutdown
!
interface FastEthernet0/1/0
 switchport mode access
 switchport nonegotiate
!
interface FastEthernet0/1/1
 switchport mode access
 switchport nonegotiate
!
interface FastEthernet0/1/2
 switchport mode access
 switchport nonegotiate
!
interface FastEthernet0/1/3
 switchport mode access
 switchport nonegotiate
!
interface Vlan1
 no ip address
 shutdown
!
ip classless
!
ip flow-export version 9
[...]
no cdp run
!
banner motd ^CUnauthorized access is strictly prohibited (Tout acces non autorise est strictement interdit)^C
[...]
line con 0
 password 7 082D495A041C0C19
 login
!
line aux 0
!
line vty 0 4
 login
line vty 5 15
 login
[...]
end
----

.2+|b.     |Quittez la session actuelle en mode console jusqu'à ce que le message suivant apparaisse :
a|
.Retour iOS
----
R1 con0 is now available
Press RETURN to get started.
----
.6+|c.     |Appuyez sur *Entrée* pour obtenir le message suivant :
a|
.Retour iOS
----
Unauthorized access is strictly prohibited. (Accès sans autorisation strictement interdit.)
User Access Verification
Password:
----
|Pourquoi chaque routeur doit-il avoir une bannière de message du jour (MOTD) ? 
a|
[TIP,caption=Réponse]
====
Permet d’avertir les utilisateurs en cas de violation d'accès.
====
|Si vous n'êtes pas invité à entrer un mot de passe, quelle commande de ligne de console avez-vous oublié de configurer ? 
a|
[TIP,caption=Réponse]
====
C'est le fait d'avoir oublié 2 commande :

`*password letmein*` et `*login*`
====
.3+|d.     |Entrez les mots de passe requis pour revenir au mode d'exécution privilégié.
|Si vous configurez d'autres mots de passe sur le routeur, s'affichent-ils dans le fichier de configuration en texte clair ou chiffrés ? Expliquez votre réponse.
a|
[TIP,caption=Réponse]
====
Ile seront chiffrés du fait de l’exécution de la commande : `*service password-encryption*`
====
|===

== Partie 3 : enregistrer le fichier de configuration en cours

=== Étape 1 : Enregistrez le fichier de configuration dans la mémoire NVRAM.

[frame=none,grid=none,cols="~,~"]
|===
.7+|a.     |Vous avez configuré les paramètres initiaux du routeur R1. Sauvegardez le fichier de configuration en cours dans la mémoire vive non volatile pour vous assurer que les modifications apportées seront conservées en cas de redémarrage du système ou de coupure de courant.
|Quelle commande avez-vous exécutée pour enregistrer la configuration dans la mémoire NVRAM ?
a|
[TIP,caption=Réponse]
====
J'ai lancé la commande `*copy running-config startup-config*`
====
|Quelle est la version la plus courte et non ambiguë de cette commande ?
a|
[IMPORTANT,caption=Erreur]
====
??
====
|Quelle commande affiche le contenu de la mémoire NVRAM ?
a|
[IMPORTANT,caption=Erreur]
====
??
====
|b.     |Vérifiez que tous les paramètres configurés ont été enregistrés. Si ce n'est pas le cas, analysez le résultat et déterminez quelles commandes n'ont pas été exécutées ou ont été saisies incorrectement. Vous pouvez également cliquer sur Check Results (vérifier les résultats) dans la fenêtre d'instructions.
|===
[TIP,caption=Réponse]
====
Je suis bien à *100%*
====

=== Étape 2 (bonus facultatif) : Enregistrez le fichier de configuration initiale dans la mémoire Flash.

Vous en apprendrez plus sur la gestion du stockage Flash d'un routeur dans les chapitres ultérieurs. Toutefois, sachez qu'en guise de procédure de sauvegarde supplémentaire, vous pouvez enregistrer votre fichier de configuration initiale dans la mémoire Flash. Par défaut, le routeur continue à charger la configuration initiale à partir de la mémoire NVRAM, mais si cette mémoire est endommagée, vous pouvez restaurer la configuration initiale en la copiant à partir de la mémoire Flash.

Procédez comme suit pour enregistrer la configuration initiale dans la mémoire Flash.

[frame=none,grid=none,cols="~,~"]
|===
.8+|a.     |Examinez le contenu de la mémoire Flash à l'aide de la commande *show flash* :
a|
.Commande iOS
[source,bash]
----
R1# show flash
----

.Retour iOS
----
System flash directory:
File  Length   Name/status
  3   33591768 c1900-universalk9-mz.SPA.151-4.M4.bin
  2   28282    sigdef-category.xml
  1   227537   sigdef-default.xml
[33847587 bytes used, 221896413 available, 255744000 total]
249856K bytes of processor board System flash (Read/Write)
----

|Combien de fichiers sont actuellement stockés dans la mémoire Flash ?
a|
[TIP,caption=Réponse]
====
Il y a actuellement '*3*' fichiers.
====
|Selon vous, lequel de ces fichiers est le fichier d'image IOS ?
a|
[TIP,caption=Réponse]
====
c'est le fichier : *c1900-universalk9-mz.SPA.151-4.M4.bin*
====
|Pourquoi pensez-vous que ce fichier est le fichier d'image IOS ?
a|
[TIP,caption=Réponse]
====
Car son fichier termine par l’extension *.bin*
====
.3+|b.     |Enregistrez le fichier de configuration initiale dans la mémoire Flash à l'aide des commandes suivantes :
a|
.Commande iOS
[source,bash]
----
R1# copy startup-config flash
Destination filename [startup-config]
----
|Le routeur vous invite à stocker le fichier dans la mémoire Flash avec le nom entre parenthèses. Si le nom vous convient, appuyez sur *Entrée*, sinon, tapez un nom approprié et appuyez sur *Entrée*.
.2+|c.     |Utilisez la commande *show flash* pour vérifier que le fichier de configuration initiale est à présent stocké dans la mémoire Flash.
.Commande iOS
[source,bash]
----
R1# show flash
----

.Retour iOS
----
System flash directory:
File  Length   Name/status
  3   33591768 c1900-universalk9-mz.SPA.151-4.M4.bin
  2   28282    sigdef-category.xml
  1   227537   sigdef-default.xml
  4   1279     startup-config
[33848866 bytes used, 221895134 available, 255744000 total]
249856K bytes of processor board System flash (Read/Write)
----
|===