= TP 3/6 Packet Tracer : Configuration des mots de passe sécurisés et de SSH
:navtitle: Config Mot de passe et SSH

.Table d'adressage
****
[cols="~,~,~,~,~,~"]
|===
| Device | Interface | IP Address   | Subnet Mask   | Default Gateway
| RTA    | G0/0      | 172.16.1.1   | 255.255.255.0 | N/A
| PCA    | NIC       | 172.16.1.10  | 255.255.255.0 | 172.16.1.1
| SW1    | VLAN 1    | 172.16.1.2   | 255.255.255.0 | 172.16.1.1
|===
****
== Objectif

L'administrateur réseau vous a demandé de préparer RTA et SW1 en vue de leur déploiement. Avant de les connecter au réseau, les mesures de sécurité doivent être activées.


== Étape 1: Configuration de la sécurité de base sur le routeur

Ouvrir l'invite de commande

[cols="~,~",frame=none,grid=none]
|===
|a.     a|Configurer l'adressage IP sur PCA conformément au tableau d'adressage.

image::tssr2023/modules-07/TP/02_3/01.png[aligne"center"]

|b.     a| Console dans RTA à partir du terminal sur PCA.

image::tssr2023/modules-07/TP/02_3/01.png[aligne"center"]

|c.     a|Configurez le nom d'hôte comme RTA.

.command iOS
[source,cmd]
----
Router>enable
Router#conf t
Router(config)#hostname RTA
----

|d.     a|Configurez l'adressage IP sur RTA et activez l'interface.

.command iOS
[source,cmd]
----
RTA(config)#interface g0/0
RTA(config-if)#ip address 172.16.1.1 255.255.255.0 
RTA(config-if)#no shutdown 
RTA(config-if)#exit
----



|e.     a|Chiffrer tous les mots de passe en clair.

.command iOS
[source,cmd]
----
RTA(config)#service password-encryption
----

|f.      a|Fixez la longueur minimale du mot de passe à 10.

.command iOS
[source,cmd]
----
RTA(config)# security password min-length 10
----



|g.     a|Définissez un mot de passe secret fort de votre choix. 

[NOTE,caption=Remarque]
====
Choisissez un mot de passe dont vous vous souviendrez, sinon vous devrez réinitialiser l'activité si vous êtes bloqué hors de l'appareil.
====

.command iOS
[source,cmd]
----
RTA(config)#line console 0
RTA(config-line)#password LoginUsers
RTA(config-line)#login
RTA(config-line)#exit
RTA(config)#enable secret LoginRootSan
----

|h.     a|Désactiver la recherche DNS.

.command iOS
[source,cmd]
----
RTA(config)# no ip domain-lookup
----

|i.      a|Définissez le nom de domaine à CCNA.com (sensible à la casse pour la notation dans PT).

.command iOS
[source,cmd]
----
RTA(config)# ip domain-name CCNA.com
----

|j.      a|Créez un utilisateur de votre choix avec un mot de passe crypté fort.

.command iOS
[source,cmd]
----
RTA(config)#username julie secret LoginBidule
----


|k.     a|Générer des clés RSA de 1024 bits.

NOTE: Dans Packet Tracer, entrez la commande `*crypto key generate rsa*` et appuyez sur Enter pour continuer.

.command iOS
[source,cmd]
----
RTA(config)# crypto key generate rsa
----

The name for the keys will be: RTA.CCNA.com

Choose the size of the key modulus in the range of 360 to 2048 for your

General Purpose Keys. Choosing a key modulus greater than 512 may take

a few minutes.
----
Mdp login : LoginUsers
Mdp root : LoginRootSan
----
 

How many bits in the modulus [512]: 1024

| l.      a|Block anyone for three minutes who fails to log in after four attempts within a two-minute period.

RTA(config)# login block-for 180 attempts 4 within 120

|m.   a|Configure all VTY lines for SSH access and use the local user profiles for authentication.

RTA(config)# line vty 0 4

RTA(config-line)# transport input ssh

RTA(config-line)# login local

|n.     a|Set the EXEC mode timeout to 6 minutes on the VTY lines.

RTA(config-line)# exec-timeout 6

|o.     a|Save the configuration to NVRAM.

Close configuration window

|p.     a|Access the command prompt on the desktop of PCA to establish an SSH connection to RTA.

Open a command prompt

C:\> ssh /?

Packet Tracer PC SSH

Usage: SSH -l username target

C:\>
|===

Close a command prompt

Step 2: Configure Basic Security on the Switch
Configure switch SW1 with corresponding security measures. Refer to the configuration steps on the router if you need additional assistance.

a.     Click on SW1 and select the CLI tab.

Open a configuration window

b.     Configure the hostname as SW1.

c.     Configure IP addressing on SW1 VLAN1 and enable the interface.

d.     Configure the default gateway address.

e.     Disable all unused switch ports.

Note: On a switch it is a good security practice to disable unused ports. One method of doing this is to simply shut down each port with the ‘shutdown’ command. This would require accessing each port individually. There is a shortcut method for making modifications to several ports at once by using the interface range command. On SW1 all ports except FastEthernet0/1 and GigabitEthernet0/1 can be shutdown with the following command:

SW1(config)# interface range F0/2-24, G0/2

SW1(config-if-range)# shutdown

%LINK-5-CHANGED: Interface FastEthernet0/2, changed state to administratively down

 

%LINK-5-CHANGED: Interface FastEthernet0/3, changed state to administratively down

<Output omitted>

%LINK-5-CHANGED: Interface FastEthernet0/24, changed state to administratively down

 

%LINK-5-CHANGED: Interface GigabitEthernet0/2, changed state to administratively down

The command used the port range of 2-24 for the FastEthernet ports and then a single port range of GigabitEthernet0/2.

f.      Encrypt all plaintext passwords.

g.     Set a strong secret password of your choosing.

h.     Disable DNS lookup.

i.      Set the domain name to CCNA.com (case-sensitive for scoring in PT).

j.      Create a user of your choosing with a strong encrypted password.

k.     Generate 1024-bit RSA keys.

l.      Configure all VTY lines for SSH access and use the local user profiles for authentication.

m.   Set the EXEC mode timeout to 6 minutes on all VTY lines.

n.     Save the configuration to NVRAM.

Close a configuration window

End of document