= TP 5/6 Packet Tracer : Mise en œuvre de la sécurité des ports
:navtitle: Sécurité des ports

.Table d'adressage
****
[cols="~,~,~,~"]
|===
| Device       | Interface | IP Address  | Subnet Mask
| S1           | VLAN 1    | 10.10.10.2  | 255.255.255.0
| PC1          | NIC       | 10.10.10.10 | 255.255.255.0
| PC2          | NIC       | 10.10.10.11 | 255.255.255.0
| Rogue Laptop | NIC       | 10.10.10.12 | 255.255.255.0
|===
****

== Objectif

* Partie 1: Configurer la sécurité des ports
* Partie 2: Vérifier la sécurité des ports

== Contexte

Dans cette activité, vous allez configurer et vérifier la sécurité des ports sur un commutateur. La sécurité des ports permet de restreindre le trafic entrant d'un port en limitant les adresses MAC autorisées à envoyer du trafic dans le port.

== Étape 1: Configurer la sécurité des ports

[cols="~,~",frame=none,grid=none]
|===
|a.     a| Accédez à la ligne de commande de S1 et activez la sécurité des ports sur les ports Fast Ethernet 0/1 et 0/2.

.command iOS
[source,cmd]
----
S1(config)# interface range f0/1 – 2
S1(config-if-range)# switchport port-security
----

|b.     a|Définissez le maximum pour qu'un seul appareil puisse accéder aux ports Fast Ethernet 0/1 et 0/2.

.command iOS
[source,cmd]
----
S1(config-if-range)# switchport port-security maximum 1
----

|c.     a|Sécuriser les ports de manière à ce que l'adresse MAC d'un appareil soit apprise dynamiquement et ajoutée à la configuration en cours.

.command iOS
[source,cmd]
----
S1(config-if-range)# switchport port-security mac-address sticky
----

|d.     a|Définissez le mode de violation de manière à ce que les ports Fast Ethernet 0/1 et 0/2 ne soient pas désactivés en cas de violation, mais qu'une notification de violation de sécurité soit générée et que les paquets provenant d'une source inconnue soient abandonnés.

.command iOS
[source,cmd]
----
S1(config-if-range)# switchport port-security violation restrict
----

|e.     a|Désactiver tous les ports inutilisés restants. Utilisez le mot-clé range pour appliquer cette configuration à tous les ports simultanément.

.command iOS
[source,cmd]
----
S1(config-if-range)# interface range f0/3 - 24 , g0/1 - 2
S1(config-if-range)# shutdown
----
|===


== Étape 2: Vérifier la sécurité des ports

[cols="~,~",frame=none,grid=none]
|===
|a.     a|Depuis le PC1, envoyez un ping au PC2.

|b.     a|Vérifiez que la sécurité des ports est activée et que les adresses MAC de PC1 et PC2 ont été ajoutées à la configuration en cours d'exécution.

.command iOS
[source,cmd]
----
S1# show run \| begin interface
----

|c.     a|Utilisez les commandes port-security show pour afficher les informations de configuration.

.command iOS
[source,cmd]
----
S1# show port-security
S1# show port-security address
----

|d.     a|Branchez l'ordinateur portable Rogue sur un port de commutateur inutilisé et remarquez que les voyants de liaison sont rouges.

|e.     a|Activez le port et vérifiez que l'ordinateur portable inconnu peut envoyer un ping à PC1 et PC2. Après vérification, fermez le port connecté à l'ordinateur portable malveillant.

|f.      a|Déconnectez PC2 et connectez l'ordinateur portable malveillant à F0/2, qui est le port auquel PC2 était connecté à l'origine. Vérifiez que l'ordinateur portable malveillant n'est pas en mesure d'envoyer un signal ping à PC1.

|g.      a|Afficher les violations de la sécurité du port pour le port auquel le portable Rogue est connecté.

.command iOS
[source,cmd]
----
S1# show port-security interface f0/2
----

Combien d'infractions ont été commises ?

[TIP,caption=Réponse]
====

====

|h.    a|Déconnectez l'ordinateur portable Rouge et reconnectez le PC2. Vérifier que le PC2 peut envoyer un ping au PC1.


Pourquoi le PC2 est-il en mesure d'envoyer un ping au PC1, alors que le portable Rouge ne l'est pas ?

[TIP,caption=Réponse]
====

====
|===